In [126]:
import pandas as pd

In [127]:
data = pd.read_csv('./csv_file/국민여행조사.csv', encoding='utf-8')

In [128]:
data = data[data['MON_EXP_1'] == 1]

In [129]:
data_남자 = data[data['BSEX'] == 1.0]

In [130]:
data_m_20 = data_남자[data_남자['BAGE'] == 2]

In [131]:
data_m_20.reset_index(drop=True, inplace=True)

In [132]:
data_m_20

,ID,MON_EXP_1,A2_1,A2_2,A2_3,A3_1,A3_2,A3_3,A3_4,A3_5,...,A7B_5,A7B_6,A7B_7,A12,A13,A14,BSEX,BAGE,BARA,WT_DOM
0,1101069027A_1030489,1,3,5,8,1,2,,4,,...,,,,4,4,4,1,2,11,39415.273346
1,11030520921_1000130,1,1,14,,,,3,,,...,,,,5,4,4,1,2,11,13902.803793
2,11030700191_1097793,1,4,3,,1,2,3,,,...,,,,5,4,4,1,2,11,20364.886416
3,11030710301_1128662,1,4,2,,1,2,3,,,...,,,,5,4,4,1,2,11,5731.835769
4,1104052022A_1094206,1,4,11,8,1,2,,,,...,,,,3,3,3,1,2,11,18675.288335
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
1705,3901066179A_1283594,1,4,3,5,1,2,,,,...,,,,4,4,4,1,2,39,2106.701574
1706,3901066233A_1320262,1,5,2,11,1,2,,,,...,,,,4,4,4,1,2,39,7292.602687
1707,3901066309A_1381942,1,3,5,2,1,2,,,,...,,,,4,4,3,1,2,39,2737.316157
1708,39010670541_1319154,1,2,5,1,,2,3,,5,...,,,,3,4,4,1,2,39,5412.474300
1709,3902057051A_1221662,1,5,3,9,1,,3,,,...,,,,5,4,4,1,2,39,3671.340901

In [136]:
op1 = data_m_20.A2_1.value_counts().sort_values()
op1 = op1.to_dict()
op1
# 남자 20대 여행 여행지 선택이유 1위
# 1: 볼거리 제공, 2 : 여행지 지명도, 3 : 이동거리

{'13': 7,
 '15': 12,
 '10': 23,
 '7': 25,
 '6': 34,
 '12': 40,
 '9': 73,
 '3': 93,
 '11': 105,
 '8': 115,
 '14': 141,
 '5': 151,
 '4': 166,
 '1': 336,
 '2': 389}

In [137]:
n = 4
rank1 = []
row1 = []
for rank, row in op1.items():
    rank1.append(rank)
    row1.append(n*row)
op1 = dict(zip(rank1, row1))
op1 = pd.DataFrame.from_dict(op1, orient='index', columns=['pick_이유'])
op1

    pick_이유
13       28
15       48
10       92
7       100
6       136
12      160
9       292
3       372
11      420
8       460
14      564
5       604
4       664
1      1344
2      1556

In [138]:
op2 = data_m_20.A2_2.value_counts().sort_values()
op2 = op2.to_dict()
# 남자 20대 여행 여행지 선택이유 2위
# 1 : 여행지 지명도, 2 : 볼거리 제공, 3 : 여행 동반자 유형

In [139]:
n = 2
rank2 = []
row2 = []
for rank, row in op2.items():
    rank2.append(rank)
    row2.append(n*row)
op2 = dict(zip(rank2, row2))
op2 = pd.DataFrame.from_dict(op2, orient='index', columns=['pick_이유'])
op2

    pick_이유
15        2
13       20
10       34
7        42
6        62
12      116
9       120
3       186
11      214
8       238
        270
4       324
5       330
14      358
2       530
1       574

In [140]:
op3 = data_m_20.A2_3.value_counts().sort_values()
op3 = op3.to_dict()
op3

{'15': 2,
 '13': 5,
 '7': 9,
 '10': 18,
 '6': 25,
 '12': 49,
 '9': 50,
 '3': 75,
 '8': 80,
 '11': 82,
 '5': 109,
 '4': 114,
 '14': 156,
 '1': 159,
 '2': 186,
 ' ': 591}

In [141]:
n = 1
rank3 = []
row3 = []
for rank, row in op3.items():
    rank3.append(rank)
    row3.append(n*row)
op3 = dict(zip(rank3, row3))
op3 = pd.DataFrame.from_dict(op3, orient='index', columns=['pick_이유'])
op3
# 남자 20대 여행 여행지 선택이유 3위
# 1 : 볼거리 제공, 2 : 여행지 지명도, 3 : 여행 동반자 유형

    pick_이유
15        2
13        5
7         9
10       18
6        25
12       49
9        50
3        75
8        80
11       82
5       109
4       114
14      156
1       159
2       186
        591

In [142]:
op = pd.merge(op1, op2, left_index=True, right_index=True)
op = pd.merge(op, op3, left_index=True, right_index=True)
op

    pick_이유_x  pick_이유_y  pick_이유
13         28         20        5
15         48          2        2
10         92         34       18
7         100         42        9
6         136         62       25
12        160        116       49
9         292        120       50
3         372        186       75
11        420        214       82
8         460        238       80
14        564        358      156
5         604        330      109
4         664        324      114
1        1344        574      159
2        1556        530      186

In [144]:
op['sum'] = op.sum(axis=1)

In [150]:
op.sort_values(by=['sum'], ascending=False)
op1 = op.filter(['sum'])

In [152]:
op1.to_csv('20M 여행지 선택이유.to_csv')

In [95]:
def survey(x, n1):
    n = 0
    for i in range(len(data_m_20)):
        if data_m_20[x][i] == n1:
            n += 1
    print('{}'.format(n1), ': ', n)

In [118]:
survey('A3_1', '1')
survey('A3_2', '2')
survey('A3_3', '3')
survey('A3_4', '4')
survey('A3_5', '5')
survey('A3_6', '6')
survey('A3_7', '7')
survey('A3_8', '8')
survey('A3_9', '9')
survey('A3_10', '10')
survey('A3_11', '11')
survey('A3_12', '12')
survey('A3_13', '13')
survey('A3_14', '14')
survey('A3_15', '15')
survey('A3_16', '16')
survey('A3_17', '17')
survey('A3_18', '18')
survey('A3_19', '19')
survey('A3_20', '20')
survey('A3_21', '21')
# 1 : 자연 및 풍경감상, 2 : 휴식&휴양 3 : 음식관광

1 :  1234
2 :  874
3 :  144
4 :  151
5 :  180
6 :  988
7 :  22
8 :  129
9 :  81
10 :  7
11 :  79
12 :  18
13 :  10
14 :  0
15 :  107
16 :  95
17 :  118
18 :  85
19 :  4
20 :  6
21 :  30

In [12]:
data_m_20.columns

Index(['ID', 'MON_EXP_1', 'A2_1', 'A2_2', 'A2_3', 'A3_1', 'A3_2', 'A3_3',
       'A3_4', 'A3_5', 'A3_6', 'A3_7', 'A3_8', 'A3_9', 'A3_10', 'A3_11',
       'A3_12', 'A3_13', 'A3_14', 'A3_15', 'A3_16', 'A3_17', 'A3_18', 'A3_19',
       'A3_20', 'A3_21', 'A4_1', 'A4_2', 'A4_3', 'A4A_1', 'A4A_2', 'A4A_3',
       'A5_1', 'A5_2', 'A5_3', 'A6_1', 'A6_2', 'A6_3', 'A6_4', 'A6_5', 'A6_6',
       'A6_7', 'A6_8', 'A6_9', 'A6_10', 'A6_11', 'A6_12', 'A6_13', 'A6_14',
       'A7', 'A7A', 'A7B_1', 'A7B_2', 'A7B_3', 'A7B_4', 'A7B_5', 'A7B_6',
       'A7B_7', 'A12', 'A13', 'A14', 'BSEX', 'BAGE', 'BARA', 'WT_DOM'],
      dtype='object')

In [16]:
data_m_20.A4_1.value_counts()
# 여행정보획득경로 1순위
# 1 : 주변인 2 : 과거 방문 경험 3 : 인터넷 사이트/모바일

5    621
7    444
1    298
8    217
2     60
3     43
6     20
4      5
9      2
Name: A4_1, dtype: int64

In [17]:
data_m_20.A4_2.value_counts()
# 여행정보획득경로 2순위
# 1 : 주변인 2 : 인터넷 사이트/모바일 3 : 과거 방문 경험

     1053
5     242
1     183
7     118
2      54
3      44
6      15
4       1
Name: A4_2, dtype: int64

In [23]:
data_m_20.A4_3.value_counts()
# 여행정보획득경로 3순위
# 1 : 인터넷 사이트/모바일 2 : 기사 및 방송프로그램 3 : 주변인

     1559
1      52
2      30
5      29
3      18
7      16
6       4
4       2
Name: A4_3, dtype: int64

In [24]:
data_m_20.A4A_1.value_counts()
# 참고한 인터넷사이트 1순위
# 1 : 포털사이트 2 : SNS 3 : 여행 관련 블로그

     1177
1     308
3      96
5      63
4      32
2      15
7      11
8       5
6       3
Name: A4A_1, dtype: int64

In [26]:
data_m_20.A4A_2.value_counts()
# 참고한 인터넷사이트 2순위
# 1 : 포털사이트 2 : SNS 3 : 여행 관련 블로그

     1386
1      89
3      72
5      55
4      52
2      27
7      14
8      12
6       3
Name: A4A_2, dtype: int64

In [27]:
data_m_20.A4A_3.value_counts()
# 참고한 인터넷사이트 2순위
# 1 : 포털사이트 2 : SNS 3 : 여행 동영상

     1618
1      20
3      19
4      19
5       9
8       8
2       8
7       6
6       3
Name: A4A_3, dtype: int64

In [28]:
data_m_20.A7B_1.value_counts()

     1504
1     206
Name: A7B_1, dtype: int64

In [29]:
data_m_20.A7B_2.value_counts()

     1696
2      14
Name: A7B_2, dtype: int64

In [30]:
data_m_20.A7B_3.value_counts()

3    1383
      327
Name: A7B_3, dtype: int64

In [31]:
data_m_20.A7B_4.value_counts()

     1692
4      18
Name: A7B_4, dtype: int64

In [32]:
data_m_20.A7B_5.value_counts()

     1692
5      18
Name: A7B_5, dtype: int64

In [33]:
data_m_20.A7B_6.value_counts()

     1697
6      13
Name: A7B_6, dtype: int64

In [34]:
data_m_20.A7B_7.value_counts()

     1709
7       1
Name: A7B_7, dtype: int64

In [35]:
# 여행 동반자 순위
# 1 : 친구/연인 2 : 가족 3 : 동료, 친목 단체

In [36]:
data_m_20.A12.value_counts()

4    1252
5     374
3      79
2       5
Name: A12, dtype: int64

In [37]:
data_m_20.A13.value_counts()

4    1281
5     243
3     175
2      10
1       1
Name: A13, dtype: int64

In [38]:
data_m_20.A14.value_counts()

4    1282
3     229
5     188
2       9
1       2
Name: A14, dtype: int64